/*************************************************************************
			Gestion sortie - tache gerant les barrieres de sortie
			-----------------------------------------------------
	debut   			 : 18/03/2016
	copyright            : (C) gestionSortie.h par B3330
	e-mail               : paul-emmanuel.sotir@insa-lyon.fr
*************************************************************************/

//-- Interface de la tache <GESTION_SORTIE> (fichier gestionSortie.h) ----
#ifndef GESTION_SORTIE_H
#define GESTION_SORTIE_H

//------------------------------------------------------------------------
// Role de la tache
//
//
//------------------------------------------------------------------------

/////////////////////////////////////////////////////////////////  INCLUDE
//--------------------------------------------------- Interfaces utilisées
#include "msvc_utils.h"

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------ Types

//////////////////////////////////////////////////////////////////  PUBLIC
//---------------------------------------------------- Fonctions publiques
pid_t ActiverPorteSortie();


#endif // GESTION_SORTIE_H
